:PROPERTIES:
:GPTEL_MODEL: z-ai/glm-5.1
:GPTEL_BACKEND: GPTEL
:GPTEL_SYSTEM: You are a large language model living in Emacs and a helpful assistant. Respond concisely.
:GPTEL_TOOLS: Bash Eval WebSearch WebFetch YouTube Diagnostics Mkdir Edit Insert Write Glob Read Grep TodoWrite Skill Agent
:GPTEL_BOUNDS: ((tool (23296 23441 "call_807550ad5fe34052872f628a") (23505 23674 "call_807550ad5fe34052872f628a") (23755 24014 "call_f0256972ffb440fca8d3b756") (24095 24326 "call_f0256972ffb440fca8d3b756") (24407 24582 "call_7e680bb1cc6c448eaa407d7e") (24663 26120 "call_7e680bb1cc6c448eaa407d7e") (26201 28107 "call_7e680bb1cc6c448eaa407d7e") (28188 32084 "call_30faa18601094b48a2330f16") (32165 33097 "call_f5e48fabbfb74be5a98a1fdb") (33232 33409 "call_da6ad618abeb442a951f98f6") (33552 33749 "call_f5d205635d3544e28f41dc27") (44219 44364 "toolu_bdrk_01R3aBufiigUwfZmExp1oCWu") (47238 47411 "toolu_bdrk_012QVmyukdz9mz8XxZJQMAy5") (47494 47667 "toolu_bdrk_01McY2d8yLVnVUCjH2kXQkQo") (47750 51914 "toolu_bdrk_01EokxcvN92SBw6AcEpoRxAb")) (response (1298 22730) (22748 23242) (33761 35218) (42238 44162) (44376 46978) (47098 47165) (51926 53210) (55122 57837) (57855 59152)))
:END:
*** Fix 2 (alternative): Switch to Biblatex/Biber instead of Natbib

Change your org file header to:
#+begin_src org
#+CITE_EXPORT: biblatex
#+end_src

And in your =preamble.tex=, replace:
#+begin_src latex
\usepackage{natbib}
#+end_src
with:
#+begin_src latex
\usepackage[backend=biber, style=authoryear]{biblatex}
\addbibresource{internment_refs.bib}
#+end_src

And make sure your =org-latex-pdf-process= uses =latexmk= or runs biber:
#+begin_src elisp
(setq org-latex-pdf-process '("latexmk -pdf -shell-escape %f"))
#+end_src

#+RESULTS:
| latexmk -pdf -shell-escape %f |

